[{"created":1527595558000,"duration":7200000,"id":"251200777","name":"Big Data on AWS","status":"upcoming","time":1531753200000,"local_date":"2018-07-16","local_time":"18:00","updated":1530356423000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":183,"venue":{"id":25844868,"name":"AWS Offices.","lat":32.07419967651367,"lon":34.79216766357422,"repinned":false,"address_1":"121 Menachem Begin rd. Level 28.","city":"Tel Aviv","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/251200777/","description":"<p>18:00 - 18:30 - Gathering, AWS news, Food And Drinks.</p> <p>18:30 - 19:00 - How to squeeze ETLs performance from hours to minutes.<br/>by Eitan Sela - System Architect, WeissBeerger - an ABInbev company.</p> <p>Eitan will share from his own experience how they managed to reduce their ETLs run time from hours to minutes, using Amazon EMR service and Big Data Frameworks like Hadoop, Hive and Spark.</p> <p>19:00 - 19:30 - Squeegee - Open Source, \"Serverless\" AWS Cost and Usage Analysis at Scale - by Elliott Spira</p> <p>Squeegee is an open source tool built by Atlassian to manage the processing and analysis of complex data from the cost and usage report. Squeegee shows off a lot of serverless services (Athena, Glue) and is a good showcase of how big datasets can be processed in a lower maintenance, more cost-effective fashion.</p> <p>Elliott is the co-founder of GorillaStack, an Australian software company that creates tools that save time and money for developers and DevOps engineers.<br/>Elliott is visiting Israel on a government trade mission and is looking for partnerships with Israeli companies.</p> <p>19:30 - 20:00 - Advanced GPU operations on AWS - by Gil Bahat</p> <p>GPUs/AI workload requires certain experience to operate. In this talk we will look how external factors and multiple requirements could make this task more complex than the usual. In particular we’re looking at spot market requirements, supporting a joint GFX workload, adding requisite AI acceleration libraries and maintaining streamlined operations</p> <p>* Spot market for GPUs<br/>* Right-sizing for your payload<br/>* To docker or not to docker<br/>* NVIDIA-ML library and some random nuances<br/>* NVIDIA GLX / X11 and random nuances<br/>* Video acceleration<br/>* AI acceleration libraries<br/>* Keeping devs in check</p> <p>About Gil: I am an independent DevOps consultant currently employed by Magisto, after a 4 year tenure as resident one-man-team DevOps engineer, with particular interest in the areas of GPU usage for both AI and GFX purposes.</p> <p>If you'd like to submit a talk please email-<br/>Shimon - [masked] and Niv - [masked]</p> ","visibility":"public"}]