[{"created":1548928906000,"duration":7200000,"id":"258555393","name":"Overcoming messy things on AWS","date_in_series_pattern":false,"status":"past","time":1551196800000,"local_date":"2019-02-26","local_time":"18:00","updated":1551206384000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":206,"venue":{"id":26132688,"name":"Imperva office, 27th floor","lat":32.07295608520508,"lon":34.78952407836914,"repinned":true,"address_1":"Menachem Begin Road 125","city":"Tel Aviv","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","state":"","country":"il","region":"en_US","timezone":"Asia/Jerusalem"},"link":"https://www.meetup.com/AWS-IL/events/258555393/","description":"<p>Doing certain things on AWS can be a real pain in the a** .<br/>It's sure a lot better to learn how to do them from people who already faced these challenges and managed to overcome them.<br/>Join us in this upcoming meetup to hear from our community members about how they overcame and managed to implement some of the less \"sexy\" needs on AWS.</p> <p>18:00 - 18:15 - Gathering, Food And Drinks.</p> <p>18:15 - 18:30 - AWS News</p> <p>18:30 - 19:00 - Super charge your AWS Storage by Shlomi Avihou, Senior DevOps Engineer at Zadara.</p> <p>You'll hear about How to consume Enterprise Storage-as-a-Service in AWS:<br/>Connectivity (via AWS Direct Connect)<br/>Enhanced Storage capabilities in the cloud:<br/>Capacity utilization – Deduplication , compression<br/>Data Protection - Mirroring, Snapshots, backup to object etc.</p> <p>19:00 - 19:30 - Compliance in the Cloud and how it can prevent the next data breach by Offir Zigelman, Product Manager at Dome9.</p> <p>Compliance is not only regulations – there are standards that help your environments to be secured.<br/>You will learn what is compliance, and why it applies to everyone.<br/>We will see the challenges of compliance in the modern cloud environments, and discuss some practical suggestions.</p> <p>19:30 - 20:00 - Replacing network rules with application identity by Ran Marom, Director of Product Management at Portshift.</p> <p>Security Groups on AWS can often get messy - the amount of effort required in order to map your application to the right network rules usually doesn’t worth it. Most companies either give up and have ‘flat environment’ or struggling to keep up and ending up with a huge mess of thousands of rules that has nothing to do with the actual security and application needs.<br/>In this talk, Ran will present an internal tool Portshift developed in order to automatically discover and mitigate problems in Security Groups configurations, share common mistakes DevOps engineers usually do with their network rules, and showcase a solution that enables you to replace your Security Groups with identity-based application policies.</p> <p>See you there!</p> ","visibility":"public"}]