[{"created":1502711788000,"duration":7200000,"id":"242531881","name":"re:invent Announcements & Amazon Container Services Deep-Dive Kubernetes/Fargate","status":"past","time":1512489600000,"local_date":"2017-12-05","local_time":"18:00","updated":1512541324000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":273,"venue":{"id":25245731,"name":"Playbuzz offices ( Sarona Market building)","lat":32.0713996887207,"lon":34.78657531738281,"repinned":false,"address_1":"3 Aluf Kalman Magen St., Building A, 1st Floor","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/242531881/","description":"<p>AWS holds a yearly event in Las Vegas, during this event new services are announced.<br/>In this meetup we will go over the new services announced.</p> <p>18:00 - 18:30 - Gathering Beer &amp; Pizza<br/>18:30 - 19:00 - Global re:invent new anouncements re:cap<br/>19:30 - 20:00 - Amazon Container Services – State of the Union<br/>Last week, Amazon expanded their container services portfolio, announcing support for Kubernetes via EKS, and a new underlying technology Fargate, which supports ECS, and will support EKS next year. Join us to hear more details about those announcements, some technical overview of the new technologies, and Amazon’s vision for containers going forward<br/>Yaniv Donenfeld, Business Development Manager, Containers, AWS</p> ","visibility":"public"},{"created":1502711115000,"id":"242531729","name":"Serverless on AWS","status":"past","time":1511280000000,"local_date":"2017-11-21","local_time":"18:00","updated":1511294984000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":369,"venue":{"id":24217823,"name":"WeWork Sarona- Tel Aviv","lat":32.0713996887207,"lon":34.78657531738281,"repinned":false,"address_1":"Aluf Kalman Magen 3","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/242531729/","description":"<p>email [masked]  to submit talks</p> <p><b>18:00 - 18:30 - Gathering</b></p> <p><b>18:30 - 19:00 - Introduction to Serverless computing and AWS Lambda</b></p> <p>Serverless computing allows you to build and run applications without the need for provisioning or managing servers. With serverless computing, you can build web, mobile, and IoT backends; run stream processing or big data workloads; run chatbots, and more.</p> <p>In this session, we will learn how to get started with serverless computing with AWS Lambda, which lets you run code without provisioning or managing servers.</p> <p><i>Boaz Ziniman is a Technical Evangelist at Amazon Web Services. He helps to increase awareness of AWS cloud services and to help AWS customers understand the benefits that taking advantage of the cloud can deliver. Boaz has many years of experience with web development &amp; operations, architecture, IT management and cloud.<br/>Prior to joining AWS, Boaz worked with a variety of leading Israeli startups, managing development and operations teams, and leading cloud adoption and partnerships with major cloud vendors.</i></p> <p><b>19:00 - 19:30 - AWS Lambda Support for AWS X-Ray.<br/></b><br/>Traditional debugging methods don’t work so well for microservice based applications, in which there are multiple, independent components running on different services. <br/>X-Ray allows you to rapidly diagnose errors, slowdowns, and timeouts by breaking down the latency in your applications. <br/>In this session, I’ll demonstrate how you can use X-Ray in your own applications in just a moment, by walking us through building and analyzing a simple Lambda based application.I’ll also share various tips from my own experience using AWS Lambda functions in production.</p> <p><i>Eitan Sela - System Architect, WeissBeerger- Turning drinks into data.</i></p> <p><i><b>19:30 - 20:00 - Hard Riding AWS Lambda</b></i></p> <p><i>In this technical talk I will describe in painstaking detail how we deployed our production deep neural network TensorFlow models on AWS Lambda, taking it to its limits as regard to payload size, memory usage and runtime.</p> <p>Dr. Eyal Gruss is the Director of AI at Flatspace (<a href=\"http://flatspace.xyz/\"><a href=\"http://flatspace.xyz\" class=\"linkified\">http://flatspace.xyz</a></a>). Eyal is a machine learning researcher, consultant, entrepreneur and lecturer, with experience in various industries as: algotrading, cybersecurity, chemometry, adtech, computer vision and natural language processing. Eyal is a talpiot graduate, holds a PhD in theoretical physics, and he is also a digital artist, creating interactive installations and computer generated art.</i></p> ","visibility":"public"},{"created":1501061901000,"id":"242027525","name":"Containers at Scale on AWS","status":"past","time":1510502400000,"local_date":"2017-11-12","local_time":"18:00","updated":1510522527000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":310,"venue":{"id":24937898,"name":"WeWork Ibn-Gabirol","lat":32.074974060058594,"lon":34.78178024291992,"repinned":false,"address_1":"Ibn-Gabirol 30  ","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/242027525/","description":"<p><b>18:00 - 18:30 - Gathering Beer &amp; Pizza</b></p> <p><b>18:30 - 19:00 - Containers at runtime </b></p> <p>Containers The Hard Way - Lessons Learned While Building a Cloud Workload Protection Platform </p> <p>Kubernetes is Google's take on how to manage containers, with significant mileage and adoption since its release.<br/>For many that are strongly rooted in the Amazon world, ECS provides a rock solid integrated clustering solution for containers.</p> <p>In this session we will share the lessons we've learned, the good, the ugly and the awesome while building and running CI/CD pipeline for our cloud workload protection platform - which runs on Kubernetes, and includes batteries for multiple ECS &amp; K8S clusters on EC2.</p> <p><i>Gadi Naor - CTO &amp; Co-Founder at Alcide</i></p> <p><i>Gadi Naor brings 15 years of experience in leading the development of cyber security products to his role as CTO and Co-Founder of Alcide. Gadi has blended his management and technological background in various positions. From[masked], Gadi worked at CheckPoint where he served as Business Development Manager and Senior Developer, leading the development of CheckPoint’s Firewall core security engine and VPN software. He then served as a Senior Software Engineer at Altor Networks, a pioneer in virtualized data center security that was later acquired by Juniper Networks, where he continued to serve as a Senior Software Engineer until 2015. Prior to co-founding Alcide, Gadi was the Co-Founder and CTO of Fitfully, a microservice-based system. He holds a B.A in Computer Science from the Technion Institute of Technology.</i></p> <p><b>19:00 - 19:30 - ECS vs Kubernetes on EC2 </b></p> <p>Growing popularity  of  Containers based  architecture and CD practices stress the question what is preferable orchestration engine that will provide flexibility , efficiency and easy of use. We believe that Kuberentes meets most of requirements (open source based on Google experience with containers, growing community and tools on top of it). During this session we will show how to migrate from ECS to K8 with minimal penalty and effort.</p> <p><i>Oleg Verhovski - CTO &amp; Co-Founder at CodeFresh</i></p> <p><b>19:30 - 20:00 -  Implementing ECS  auto-scaler</b><br/>In this session, we will share our knowledge of how to build an Auto-Scaler for ECS.<br/>An ESC Auto-Scaler allows you to better utilize your infrastructure and to be able to scale instantly according to your application exact needs. When building an auto-scaler there are few parameters you need to consider: pending tasks, the tasks resource requirements, port mapping, head room etc. We will deep dive into those topics and talk about the challenges and the way we tackled it in Spotinst.</p> <p><i>Aharon Twizer, CTO &amp; Co-Founder, Spotinst</i></p> <p><b>20:00 - 20:10 - Open Stage</b></p> <p>[masked] to submit a talk</p> ","visibility":"public"},{"created":1501061972000,"id":"242027540","name":"Artificial intelligence on AWS","status":"past","time":1509465600000,"local_date":"2017-10-31","local_time":"18:00","updated":1509523598000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":379,"venue":{"id":25305072,"name":"Mindspace","lat":32.06461715698242,"lon":34.77410888671875,"repinned":false,"address_1":"Ahad Ha'Am Street 54","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/242027540/","description":"<p>email [masked] to submit a talk</p> <p><b>18:00 - 18:30 - Gathering</b></p> <p><b>18:30 - 19:00 - Albert - an AI product brought to life</b></p> <p><b><br/></b>Albert is the first ever Artificial Intelligence Marketing Platform for the Enterprise. Albert is an autonomous system, responsible for managing online marketing activities end-to-end, including autonomous audience targeting, autonomous media buying, cross-channel execution, campaign optimization, analytics and insights. In this session, you will find out what are the challenges of defining an autonomous AI product, what are the barriers (technical and psychological), and why do such a product require a unique product development approach in order to be successful.</p> <p>Ron Netzerel is the Chief Product Officer of Albert. He leads the product strategy and the full product lifecycle of Albert, as well as managing the Product and R&amp;D units. Ron has over 20 years’ experience in R&amp;D and Product Management, both in startups and in corporate, and brings expertise in transforming theoretical research into a working product. Ron holds a B.Sc. in Bio-Medical Engineering from Tel-Aviv University, and an MBA from the Interdisciplinary Center.</p> <p><img src=\"https://ssl.gstatic.com/ui/v1/icons/mail/images/cleardot.gif\" /></p> <p><b>19:00 - 19:30 - </b><b>An Introduction to the AI Services on AWS</b></p> <p>Artificial Intelligence (AI) services on the AWS cloud bring deep learning (DL) technologies like natural language understanding (NLU), automatic speech recognition (ASR), image recognition and computer vision (CV), text-to-speech (TTS), and machine learning (ML) within reach of every developer. In this session, you will be introduced to several new AI services: Amazon Lex, to build sophisticated text and voice chatbots; Amazon Rekognition, for deep learning-based image recognition; and Amazon Polly, for turning text into lifelike speech. The opportunities to apply one or more of these DL services are nearly boundless and this session will provide a number of examples and use cases to help you get started. </p> <p><i>Boaz Ziniman is a Technical Evangelist at Amazon Web Services. He helps to increase awareness of AWS cloud services and to help AWS customers understand the benefits that taking advantage of the cloud can deliver. Boaz has many years of experience with web development &amp; operations, architecture, IT management and cloud.<br/>Prior to joining AWS, Boaz worked with a variety of leading Israeli startups, managing development and operations teams, and leading cloud adoption and partnerships with major cloud vendors.</i></p> <p><b>19:00 - 19:30 TBD - Open Slot</b></p> ","visibility":"public"},{"created":1503844528000,"id":"242870431","name":"Aurora & Microsoft workloads on AWS","status":"past","time":1506524400000,"local_date":"2017-09-27","local_time":"18:00","updated":1506540252000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":72,"venue":{"id":24077303,"name":"Gartner Innovation Center Israel - GICI","lat":32.06206512451172,"lon":34.76918029785156,"repinned":false,"address_1":"Lilienblum 13","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/242870431/","description":"<p><b>18:00 - 18:30 - Gathering - Beer and Pizza. </b><br/><b>18:30 - 19:15 - Aurora-MySQL RDS</b></p> <p>is the fastest growing service in AWS history. By innovating the storage layer of the database, we have been able to improve throughput performance by 5x, scale to 64TB, and improve availability. Come talk to Rory Richardson to see if Aurora MySQL would be a good fit for your AWS database needs.</p> <p><i>Rory Richardson is the Global Business Development Manager for Aurora MySQL, RDS MySQL, and RDS MariaDB. She works with customers from large Enterprises and fast growing startups to take advantage of the latest in database technologies to meet their data demands. She believes that there is not one database for every job. Instead, AWS enables customers to choose the best database for each workload.</i></p> <p><b>19:15 - 20:00 - </b><b>Running Microsoft workload over AWS</b></p> <p>For many enterprise customers, Microsoft workloads make up 80% of their on-premises datacenter footprint. In this session, you learn why AWS is the best cloud platform for running Microsoft workloads, and explore some of the AWS services and tools for managing, automating, and optimizing those workloads. Topics of discussion include: Amazon EC2 Systems Manager; SQL Server on Amazon EC2 and Amazon RDS; enterprise solutions including SharePoint and Exchange; and Active Directory and AWS Directory Services.</p> <p><i>Stan Hutten Czapski – Sr. Manager, Microsoft Platform EMEA </i></p> ","visibility":"public"},{"created":1501073838000,"id":"242030077","name":"Security on AWS","status":"past","time":1505228400000,"local_date":"2017-09-12","local_time":"18:00","updated":1505241819000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":268,"venue":{"id":25388950,"name":"Checkpoint","lat":32.06981658935547,"lon":34.7953987121582,"repinned":false,"address_1":"Hasolelim 5","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/242030077/","description":"<p><b>18:00 - 18:30 - Gathering, Beer &amp; Pizza </b></p> <p><b>18:30 - 19:00 - Running cyber intelligence service on ECS</b></p> <p>Eran Bibi - Head of DevOps, Aqua Security</p> <p><b>19:00 - 19:30 - Guardicore</b></p> <p>Delivering hybrid cloud security from AWS </p> <p><i>Lior Neudorfer, Director of Product Management</i></p> <p><b>19:30 - 20:00 - Build your product for the cloud. Architecture overview &amp; lesson learned by Check Point lead architect.</b></p> <p><i>Building a product which integrates seamlessly into cloud environments requires deep understanding of cloud concepts and integration with cloud infrastructures &amp; services. </i></p> <p><i>Check Point cloud security product attained the competency certificate from AWS for being “ready” for the cloud, with automatic deployment, monitoring and auto-scaling. Come hear how Check Point built its cloud product to seamlessly align with cloud concepts &amp; customers automation needs. </i></p> <p>Tamir Zegman is check point’s senior software architect. He is an expert in cloud, mobile and advanced networking technologies.</p> <p>In recent  years he has designed and built Check Point’s public cloud product for AWS, focusing on auto-deployment, auto-scaling, debugability and cloud API integration.</p> <p>Tamir holds a B.Sc. (cum laude) in Mathematics &amp; Computer Science from Tel Aviv University</p> <p><b>20:00 - 20:10 - Open stage</b></p> ","visibility":"public"},{"created":1500722287000,"id":"241931017","name":"Big Data & AI on AWS","status":"past","time":1503415800000,"local_date":"2017-08-22","local_time":"18:30","updated":1503563797000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":335,"venue":{"id":25417461,"name":"TLV Partners VC","lat":0.0,"lon":0.0,"repinned":false,"address_1":"21 HaArba'a St. | Platinum Building | 3rd Floor","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/241931017/","description":"<p><b>18:00 - 18:30 - Gathering beer &amp; pizza</b></p> <p><b>18:30-19:00 -</b><b> How to Make Large Scale Predictions - Matomy</b></p> <p>Making large scale predictions may differ significantly from “normal” predictions. Training your model on millions of observations requires not only the use of a different toolbox, but sometimes a whole different approach. In this talk, we will go through some sample use cases of predictions in the hundreds of millions, training the models and running them on a large scale.</p> <p><i>Itai Blitzer, Ph.D., Head of Data at Matomy - As the Head of Data, Itai is responsible for Matomy’s DMP predictive profiles, currently covering over a billion user profiles, and processing over 20TB of new data arriving at Matomy’s servers each hour. Previously, he served as the Chief Data Scientist at Matrix.</i></p> <p><b>19:00-19:45 - Deep dive to Amazon Redshift and Spectrum</b></p> <p>Traditional data warehouses become expensive and slow down as the volume of your data grows. Amazon Redshift is a fast, simple, and cost-effective data warehouse that makes it easy to analyze all of your data using existing business intelligence tools. Amazon Redshift Spectrum is a new feature that extends Amazon Redshift’s analytics capabilities beyond the data stored in your data warehouse to also query your data directly in Amazon S3, with no loading needed. You can use Amazon Redshift and your existing business intelligence tools to run SQL queries against Exabytes of data, and Redshift Spectrum applies sophisticated query optimization, scaling fault-tolerant processing across thousands of nodes so results are fast – even with large data sets and complex queries. Join us to learn about the architecture of Amazon Redshift Spectrum, and how you can easily achieve faster analytics at a lower cost by leveraging strategies to partition and compress your data, in addition to supported columnar file formats.</p> <p><i>Maor Kleider is a Senior Product Manager for Amazon Redshift, a fast, simple and cost-effective data warehouse. Maor is passionate about collaborating with customers and partners, learning about their unique big data use cases and making their experience even better. </i></p> <p><i>Ippokratis Pandis is a Principal Engineer at Amazon Web Services currently working on Amazon Redshift. Ippokratis is the architect of Amazon Redshift Spectrum and has been developing Amazon Redshift to enable customers to query all of their data in the format of their choice, in a fast, easy and cost-effective fashion.</i></p> <p><i><b>19:45 - 20:00 Open Stage</b></i></p> <p><i><b>[masked] to submit a talk </b></i></p> <p><i><b>Thank you to TLV Partners for hosting</b></i></p> <p><img src=\"https://secure.meetupstatic.com/photos/event/e/7/7/9/600_463559257.jpeg\" /></p> <p><i><b><br/></b></i></p> ","visibility":"public"},{"created":1501525261000,"id":"242169986","name":"Cache on AWS","status":"past","time":1502809200000,"local_date":"2017-08-15","local_time":"18:00","updated":1502830360000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":159,"venue":{"id":25062868,"name":"Da House of Multi-Cloud Engineering","lat":32.07258605957031,"lon":34.788082122802734,"repinned":false,"address_1":"David Elazar 12","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/242169986/","description":"<p>18:00 - 18:30 - <b>Gathering, Beer &amp; PIzza </b></p> <p>18:30 - 19:00 - <b>Redis Version 4 - Redis Labs</b></p> <p>19:00 - 19:15 - <b>Managing ElasticCache in production - InnerActive (Fyber)</b></p> <p>19:15 - 20:00 - <b>Accelerating data access with Amazon ElastiCache for Redis and DAX</b></p> <p>When performance matters, it’s imperative to use the right tools in your architecture.<br/>Please join us in this talk where, AWS In-Memory Specialist Michael Labib, will do a deep dive on Amazon ElastiCache for Redis and cover various trends and use-cases being leveraged with the service. He’ll also discuss some of the best practices on how to effectively cache database data using Redis along with providing an overview on DAX, the DynamoDB accelerator.</p> <p>Michael Labib, Specialist SA, In-Memory NoSQL Amazon Web Services</p> <p>20:00 - 20:10 -<b> Open Stage</b></p> <p>[masked] - to submit a talk</p> ","visibility":"public"},{"created":1499245287000,"id":"241327181","name":"Containers at Scale on AWS","status":"past","time":1500476400000,"local_date":"2017-07-19","local_time":"18:00","updated":1500531916000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":196,"venue":{"id":25374904,"name":"WalkMe","lat":32.06697082519531,"lon":34.79393768310547,"repinned":false,"address_1":"Kremenetsky 3","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/241327181/","description":"<p><b>18:00 - 18:30 - Gathering - Beer &amp; Pizza</b></p> <p><b>18:30 - 19:00 - Building a Hyper-Elastic Task Processing Stack on Amazon ECS</b></p> <p>Endor is building a new and unique prediction engine which provides human behavior insights at a click of a button. In order to get the best prediction possible we need to run thousands of predictive models in parallel, all the while preserving resource and cost efficiency. Our solution is running our model building tasks on spot instances utilizing Amazon ECS’s massive scalability features. We will explain our previous solution, the new solution along with their architecture, deployment mechanism, scaling policies, and general stories of how to build a massively elastic, burst-oriented machine learning stack.</p> <p><b>Lior Regev Lead Backend Developer, Endor</b></p> <p><b>19:00 - 19:30 - Microservices and Container Orchestration at WalkMe</b></p> <p>How we run a complex microservice environment on AWS.Managing the routing and authorization of our traffic.Monitoring the health and scale of our infrastructure.Continuously deploying new services into a live environment.</p> <p><b>19:30 - 20:00 - Running Applications on Containers at Scale on AWS</b></p> <p><i>For development and test workloads, containers make deployment of code extremely convenient provide a seamless transition to production workloads. </i></p> <p><i>In this session, we will dive into some of the challenges of running microservices, such as load balancing, service discovery, and secrets management, and we’ll see how Amazon (ECS) can help address them. </i></p> <p><i>We’ll also demo how you can easily deploy microservices applications using Amazon ECS. We will cover: </i></p> <p><i>• Key microservices concepts and common patterns<br/>• Why you should use containers and the benefits of using Amazon ECS<br/>• How to run and manage applications, microservices, and deep learning technologies using Amazon ECS</i></p> <p>Yaniv Donenfeld, Business Development Manager, Containers, Amazon Web Services </p> <p><b>20:00 - 20:10 - Open Stage</b></p> ","visibility":"public"},{"created":1496564265000,"id":"240521509","name":"Serverless Use Cases, Challenges and Solutions","status":"past","time":1499176800000,"local_date":"2017-07-04","local_time":"17:00","updated":1499291792000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":245,"venue":{"id":23700569,"name":"Sunday Sky","lat":0.0,"lon":0.0,"repinned":false,"address_1":"19 HaBarzel st. Bldg. D, 2nd Floor","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/240521509/","description":"<p><b>17:00–17:30 - Gathering, Beer &amp; Food</b></p> <p><b>17:30–18:00 – \"Real world lessons from moving the entire team to serverless” Shay Lichtin Professional Services Architect at SundaySky </b></p> <p>- Building customer-facing APIs with  AWS API gateway and Lambda</p> <p>- Developing, deploying, and maintaining serverless applications</p> <p>- The good, the bad and the ugly </p> <p><b>18:00-18:30 – “Serverless Security” Shaked Zin Co-Founder &amp; CEO at PureSec. </b></p> <p>- The attack surface.<br/>- What can possibly go wrong?<br/>- Steps to secure my serverless application.</p> <p><b>18:30–19:00 – \"Lambda in Production\" Michael Sverdlin - Backend lead at Lightricks </b><br/>- Lambdas in production at Lightricks.<br/>- Debugging, logging, custom packages, security, configuration and general tips and tricks of maintaining.<br/>- AWS Lambdas and your sanity :)</p> <p><b>19:00-19:30 - Q&amp;A and open stage</b></p> ","visibility":"public"},{"created":1496089755000,"duration":1800000,"id":"240371525","name":"Win 5 Amazon Echo Dots! AWS Summit 2017 TLV -  User Group Specials","status":"past","time":1498050000000,"local_date":"2017-06-21","local_time":"16:00","updated":1498053372000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":150,"venue":{"id":25271755,"name":"Pavilion 1 - TLV Convention Center","lat":32.10631561279297,"lon":34.81330871582031,"repinned":false,"address_1":"Rokach Blvd 101","city":"Tel Aviv","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/240371525/","description":"<p>Join us for the annual Amazon Web Services Summit in Tel Aviv on June 21, 2017.</p> <p><b>3 main reasons to stop by the User Group booth:</b></p> <p>•  <b>Win Amazon Echo Dot</b> - Stop by and leave your business card for a chance to win the Amazon Echo Dot! We're going to giveaway 5 Echo Dots. The winners will be announced at 16:00. Make sure to be there!</p> <p>• <b>Grab some SWAG!</b> - SWAG is the king!</p> <p>• <b>Meet the User Group team</b> -Just to say Hello or if you want to participate in our future events, it worth to stop by.</p> <p><a href=\"https://pages.awscloud.com/AWSSummitTLV2017.html\">Register here for AWS Summit TLV 2017</a></p> <p><img src=\"https://secure.meetupstatic.com/photos/event/9/0/4/9/600_461436937.jpeg\" /></p> <p>* The AWS User Group stand will be in the middle of the Expo pavilion.</p> <p><b>3 main reasons to attend the AWS Summit TLV 2017:</b></p> <p>• Attend the Summit's keynote and over <a href=\"https://aws.amazon.com/summits/tel-aviv/agenda/\">20 breakout sessions</a>, <a href=\"https://aws.amazon.com/summits/tel-aviv/agenda/\">divided into 5 tracks</a>, led by AWS Solutions Architects and Customers.</p> <p>• At the Summit you'll have the opportunity to connect with our<a href=\"https://aws.amazon.com/summits/tel-aviv/sponsors/\"> Israeli partners</a> and get your questions answered by AWS experts at the AWS booth.</p> <p>• <a href=\"https://aws.amazon.com/summits/tel-aviv/agenda/\">Over 50 free self-paced training labs</a> that will give you a hands-on experience with the AWS Management Console.</p> ","visibility":"public"},{"created":1490957463000,"id":"238852751","name":"FinTech on AWS | San-Francisco Summit Announcements","status":"past","time":1493305200000,"local_date":"2017-04-27","local_time":"18:00","updated":1493570645000,"utc_offset":10800000,"waitlist_count":0,"yes_rsvp_count":113,"venue":{"id":25188021,"name":"Barclays Accelerator - rise","lat":32.06461715698242,"lon":34.77410888671875,"repinned":false,"address_1":"Ahad Ha'am 54","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/238852751/","description":"<p><b>18:00 - 18:30 Gathering</b></p> <p><b>18:30-18:45 - AWS San-Francisco summit announcements</b></p> <p>Redshift Spectrum</p> <p>DynamoDB DAX</p> <p>AWS CodeStar</p> <p>X-Ray for Lambda</p> <p><b>18:45 - 19:15 -EARNIX- How did we bring banks and insurance companies to use the cloud</b><br/>&lt;a href=\"http://email.awscloud.com/dc/KwqiTCOQ16Q1JCi3MdelD-xVRvLn7iX2CYJIWE4Mn3F2WfJ_y9ENvZK9IgMMNZvXG49LV2h8PhR3nRbZMaSwvKaaSTILz_mZV-DY7TXvSy90qLm0P5Cn7GSg7TOHWEngsF63RvQrIhW16OzaQP5wYx2ehyOMCj8w5I1_AaPt497SgdF3wlZQXIBkvtV_IIl7bh6G-CMMEP_LtMb5Ks4dts-FKOLukZuex6YG1Hy2VAsTxYRC88NSdlPuh5h0E8WfD9WHpxLEOLoFLd7FwGuRqv3toHt-QeWHVQ6qtMdtGRIR5-LMsAll08lHGyhbK97IFSzk5MgNHGZxggPKlW0toQ==/R00O7xzZVt0000z0TQMd1k2\"&gt;&lt;/a&gt;</p> <p> A review of how Earnix designed its cloud solution according to the restrictions and regulation imposed by customer security policies and government policies.</p> <p>We’ll discuss how each customer environment is architected with its own, segregated VPC with multiple subnets (both public and private). The customer’s data is kept on encrypted RDS instances  and encrypted EBS volumes using our own KMS generated keys.</p> <p><b>19:15 - 19:45 - How to stay laser focused today without compromising on your future architecture - Bliss Technologies</b></p> <p>Building a startup is a constant struggle between what to do today and the long term strategic goals. Oftentimes they contradict each other. In this session we will talk about the approach we take at Bliss to accommodate this issue and how, with minimal effort we increase our future readiness towards data analysis and compliance. by Effie Arditi, Co-Founder &amp; CTO, Bliss Technologies.</p> <p><b>19:45 - 20:00 - OPEN STAGE</b></p> <p>Contact [masked] to submit talks and propose a location for the meetup (Tel-Aviv)</p> ","visibility":"public"},{"created":1485969362000,"id":"237371764","name":"Big Data Lightning Talks | 3500+ Members Special Celebration","status":"past","time":1490025600000,"local_date":"2017-03-20","local_time":"18:00","updated":1490089954000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":158,"venue":{"id":24347603,"name":"AWS Pop-up Loft Tel-Aviv","lat":32.06221389770508,"lon":34.77027893066406,"repinned":false,"address_1":" Lilienblum St 23","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/237371764/","description":"<p>In this meetup we will celebrate our group reaching 3500+ members! The meetup will take place at the AWS Pop-Up Loft Tel-Aviv. There will be some special surprises.</p> <p>We will be focusing on the Big Data solutions of the AWS cloud - Redshift, Athena, EMR, IoT, ML and AI platforms</p> <p>18:00 - 18:15 - Gathering, drinks and food</p> <p>18:15 - 18:30 - Rudy Valdez- Director, Solutions Architecture, Business Development, and Training and Certification of AWS.</p> <p>18:30 - 18:50 - BigData with AWS IoT - <a href=\"http://FreshKeep.co.uk\" class=\"linkified\">http://FreshKeep.co.uk</a></p> <p>Controlling 150K smart kitchen devices with AWS IoT || Processing with Kinesis and Athena.</p> <p>Amir Ben Ari - Head of Software</p> <p>18:50 - 19:10 - Using Amazon ML to predict leads quality - <a href=\"http://Internovus.com\" class=\"linkified\">http://Internovus.com</a></p> <p>Internovus is an online acquisition and optimization company who provide unique client oriented business model.</p> <p>Multiple leads are assigned multiple times to different salespersons in order to maximize the sales..</p> <p>We use Amazon ML to evaluate the leads quality and distinguish between high/low chances of conversion.</p> <p>The model is based on 50 parameters and set the prioritization among the leads in the assignments system.</p> <p>Ran Kremer – Head of Analysis</p> <p>19:10 - 19:30 - Big Data Analytics Using Upsolver and Athena</p> <p>There are many advantages to using Amazon Athena for big data analytics, however the implementation can be quite cumbersome. In this talk, we will review the challenges of inserting data to Amazon Athena and demonstrate how Upsolver facilitates it.<br/>Upsolver offers a Cloud based platform that easily transforms raw time-series data into insights, by saving 90% of the data preparation time.</p> <p>Yoni Iny co-founder and CTO at Upsolver</p> <p>19:30 - 19:40 Open stage</p> ","visibility":"public"},{"created":1485779107000,"id":"237310611","name":"Serverless Architecture - Lightning Talks","status":"past","time":1488211200000,"local_date":"2017-02-27","local_time":"18:00","updated":1488278883000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":243,"venue":{"id":25062868,"name":"Da House of Multi-Cloud Engineering","lat":32.07258605957031,"lon":34.788082122802734,"repinned":false,"address_1":"David Elazar 12","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/237310611/","description":"<p>in this meetup we will be focusing on the Serverless architecture stack. We will have lighting talks of AWS community users showing their architecture and how they leverage the platform.</p> <p><a href=\"https://aws.amazon.com/this-is-my-architecture/\"><a href=\"https://aws.amazon.com/this-is-my-architecture/\" class=\"linkified\">https://aws.amazon.com/this-is-my-architecture/</a></a></p> <p><b>18:00-18:30 - Gathering, Beer &amp; Food</b></p> <p><b>18:30-18:50 - </b><b>Managing Serverless Microservices in the Wild </b></p> <p><i>Handing off responsibility for your microservice's infrastructure with AWS API Gateway and Lambda is great, but it also means losing visibility and influence over your app in production.</i></p> <p><i>In this talk, we'll discuss different strategies to gain insights into what actually is going on inside your serverless app.  We will present a tool we've built at atomData to get high quality, actionable logs and metrics about our services.</i></p> <p>Rotem Tamir, Software Development Team Leader, AtomData.io</p> <p><b>18:50-19:10 - Anomaly detection using Lambda and EMR</b></p> <p><i>This lightning talk will focus on showing our work building a ML-based anomaly detection engine for cloud-based customers using Lambda and EMR and integrating Lambda, API Gateway and Slack to build  a streamlined process for the daily work of our cyberanalysts.</i></p> <p>David Melamed, Technical Leader, CyberIntelligence Team (CTO Office), CloudLock Cisco</p> <p><b>19:10-19:30 - The missing link</b></p> <p><i>With the introduction of the Lambda service, Amazon started the serverless revolution. In this talk we explore some of the next steps needed to be taken for a truly serverless infrastructure and discuss a possible evolution of the cloud compute architecture</i></p> <p><i>Emmanuel Merali CEO &amp; founder at RFTP Technologies Ltd</i></p> <p><b>19:30-19:50 - Implementing a SlackBot using Serverless</b></p> <p><i>One of the classical implementations for a Slack chatbot is using the serverless architecture. In this talk Liel will present the way they build a Slack bot using the Serverless famework</i></p> <p>Liel Ran, Senior Software Engineer at Hibob</p> <p><b>19:50-20:00 - Open stage - anything you'd like to share</b></p> <p>Have a cool new open-source project?</p> <p>Looking for a hackathon buddy?</p> <p>Hiring people? Look for a job?</p> <p><b>Contact [masked] to submit a talk</b></p> ","visibility":"public"},{"created":1482591498000,"id":"236434341","name":"Cyber Security in the Cloud","status":"past","time":1485792000000,"local_date":"2017-01-30","local_time":"18:00","updated":1485880743000,"utc_offset":7200000,"waitlist_count":0,"yes_rsvp_count":341,"venue":{"id":24767840,"name":"Cybereason TLV","lat":32.07093048095703,"lon":34.7818603515625,"repinned":false,"address_1":"30 Ibn Gabirol Street, Tel Aviv-Yafo","city":"Tel Aviv-Yafo","country":"il","localized_country_name":"Israel"},"group":{"created":1361877610000,"name":"Israel AWS User Group","id":7356292,"join_mode":"open","lat":32.06999969482422,"lon":34.77000045776367,"urlname":"AWS-IL","who":"Members","localized_location":"Tel Aviv-Yafo, Israel","region":"en_US"},"link":"https://www.meetup.com/AWS-IL/events/236434341/","description":"<p><b>18:00 - 18:30 - Networking, Beer and Pizza</b></p> <p><b>18:30 - 19:15 -  Security in the Cloud - a brave new world</b></p> <p><i><a href=\"https://il.linkedin.com/in/shlomi-avivi-8752811\">Shlomi Avivi</a> - VP of Information Security at Cybereason</i></p> <p>The use of cloud infrastructure forces us to break the known security paradigms and to think differently about concepts of control and trust. Making the adjustments is not always easy and sometimes it's hard to know how to face security requirements in this new situation.</p> <p>In this meetup we will go over the changes to the known traditional security concepts and discuss a suggested approach to securing infrastructure in the cloud</p> <p><b>19:15 - 20:00 - DDOS Mitigation on the cloud using AWS Shield and recent security updates.</b></p> <p><i><a href=\"https://www.linkedin.com/in/dave-walker-5b4194\">Dave Walker</a> Specialist Solution Architect for Security and Compliance at AWS.</i></p> <p>New Developments in AWS Security: Shield, EC2 Systems Manager and More</p> <p>AWS announced a number of new security capabilities at Re:Invent likely to be of interest to User Group members; Shield, in particular Shield Advanced, is a new DDoS mitigation and cost insurance service designed to mitigate the impact of DDoS attacks both in terms of technical countermeasures and AWS utilisation costs. In this session, we’ll be looking under the covers of the service to discuss how it works.</p> <p>In addition, one of the announcements which might have been overlooked amid the range of launch announcements of whole new services, was the launch of EC2 Systems Manager; this is a suite of infrastructure utilities for both EC2 and on-premise use, which enables EC2 instance environment tests similar to OpenSCAP or OSQuery to be integrated with AWS Config, instance maintenance windows to be scheduled and managed, and secrets such as remote system access credentials and cryptographic keys to be centrally held and managed in the manner of Hashicorp Vault, Netflix Lemur and others. We’ll be looking at the use of these services, after Shield.</p> ","visibility":"public"}]